{
  "what is the library timing": "The library is open from 9 AM to 8 PM on weekdays.",
  "hi":"Hello;how may I help you?",
  "hello":"Hello;how may I help you?",
  "how to register for coding club": "Visit the Events tab in UniVerse and click on 'Join Coding Club'.",
  "who is the hod of cse department": "Prof. Rajeev Mehta is the current HOD of CSE.",
  "when is the next hackathon": "The next hackathon is scheduled on 28th July.",
  "who is founder of sitare university": "Dr. Amit Singhal.",
  "it was established in which year": "it was established in 2022 by Dr. Amit Singhal.",
  "is sitare university only for the computer science student": "Yes it is completely for the cse student.",
  "how to get admission in sitare university.": "Selection is based on your performance in Jee entrance exam.",
  "what are recquired documents for the admission.": "10th Marksheet, JEE score card, Adhaar Card, Parent's Adhaar, Electricity Bill, Father's ITR, Photograph.",
  "what program are offered at sitare university.": "B.Tech in Computer science.",
  "is there any applicatio fee.": "No.",
  "what is eligibilty criteria for admission.": "JEE percentile Above 70%.",
  "is the admission process online or offline.": "online.",
  "are there any interview.": "Yes, our admissions team will conduct video interview for all shortlisted students.",
  "are the any scholarships available for sitare university.": "A 100% scholarship covering full tuition, hostel, and food expenses is provided to all meritorious students from underprivileged backgrounds.",
  "what is average packge of sitare university.": "11 LPA.",
  "what is placement percentage of sitare university.": "approx 91.23%.",
  "does sitare university provide scholarship.": "yes, only for unprivilaged background's student.",
  "what courses are in semester 1": "Math 113 (Linear Algebra), LE 101 (Communication and Ethics), LE 101P (Social Emotional Intelligence 1), CS 106 (Python Programming), CS 105 (Introduction to Computers), CS 106P (Python Project).",
  "what is math 113 about": "Math 113 teaches Linear Algebra including matrices, vectors, and linear systems.",
  "what is le 101": "LE 101 is Introduction to Communication and Ethics.",
  "what is le 101p": "LE 101P is a book club and social-emotional intelligence activity-based course.",
  "what is cs 106": "CS 106 is Programming Methodology in Python.",
  "what is cs 106p": "CS 106P is a project course based on Python programming.",
  "what is cs 105": "CS 105 is Introduction to Computers and basic IT concepts.",
  "what courses are in semester 2": "Math 119 (Calculus), CS 103 (Mathematical Foundations), LE 102, LE 102P, CS 110 (Data Handling in Python), CS 161 (Data Structures and Algorithms).",
  "what is math 119": "Math 119 is a course on Calculus including limits, derivatives, and integration.",
  "what is cs 103": "Mathematical Foundations of Computing covering logic, functions, and discrete structures.",
  "what is cs 110": "CS 110 teaches Data Handling in Python using libraries like NumPy and Pandas.",
  "what is cs 161": "Data Structures and Algorithms including linked lists, trees, graphs, and sorting.",
  "what courses are in semester 3": "CS 109 (Probability), LE 103P, CS 108A (OOP), CS 162 (Advanced DSA), CS 145 (DBMS), CS 221 (AI), CoCo Summer.",
  "what is cs 109": "CS 109 covers Probability theory for Computer Science applications.",
  "what is cs 108a": "Object Oriented Programming using Java or Python with classes, objects, and inheritance.",
  "what is cs 162": "Advanced Data Structures and Algorithms including graphs, dynamic programming, etc.",
  "what is cs 145": "Database Management Systems including SQL and relational models.",
  "what is cs 221": "Artificial Intelligence covering foundational AI concepts.",
  "what is coco summer": "A collaborative summer project or course offered after Semester 3.",
  "what courses are in semester 4": "CS 108B (Advanced OOP), CS 276 (Search Engines), CS 246 (Massive Data Mining), CS 107 (Computer Systems), CS 229 (Machine Learning).",
  "what is cs 108b": "Advanced Object-Oriented Programming focusing on design patterns and complex architectures.",
  "what is cs 276": "Search Engines and Information Retrieval covering indexing and ranking algorithms.",
  "what is cs 246": "Mining Massive Datasets using large-scale data analysis tools and algorithms.",
  "what is cs 107": "Computer Organization and Systems including CPU design and assembly.",
  "what is cs 229": "Machine Learning including supervised, unsupervised learning, and model evaluation.",
  "what courses are in semester 5": "CS 142 (Web Development), Cornell CS 305 (Creative Problem Solving), CS 111 (Operating Systems), CS 230 (Deep Learning), Internship, CS 250 (Software Engineering Project).",
  "what is cs 142": "Web Applications Development covering front-end and back-end technologies.",
  "what is cornell cs 305": "Creative Problem Solving to build algorithmic thinking and team-based challenges.",
  "what is cs 111": "Operating Systems Principles including memory, processes, and scheduling.",
  "what is cs 230": "Deep Learning using neural networks, CNNs, and frameworks like TensorFlow.",
  "what is cs 250": "Software Engineering Project including full development lifecycle and documentation.",
  "what courses are in semester 6": "LE 300 (Economics for CS), CS 147 (HCI), CS 144 (Computer Networks), CS 231 (Applied Deep Learning), CS 251 (ML Project).",
  "what is le 300": "Economics for Computer Science students, covering micro and macro economics.",
  "what is cs 147": "Human Computer Interaction focusing on usability, UX design, and user testing.",
  "what is cs 144": "Computer Networks including internet architecture, protocols, and TCP/IP.",
  "what is cs 231": "Applications of Deep Learning to real-world domains like healthcare and NLP.",
  "what is cs 251": "A Machine Learning Project where students build and test models end-to-end.",
  "what is taught in semester 7 and 8": "Industry Research Project and Internship to gain real-world experience and apply learned skills."
}